# 8 Week SQL Challenge 

### CASE STUDY 1 - Danny's Diner

https://8weeksqlchallenge.com/case-study-1/

In [1]:
#!pip install ipython-sql
#!pip install psycopg2
%load_ext sql

In [2]:
#Connecting to postgresql database
%sql postgresql://postgres:password@localhost:5433/SQLchallenge

Connecting to 'postgresql://postgres:***@localhost:5433/SQLchallenge'

Creating relevant tables and inserting data:

In [3]:
%%sql 

CREATE SCHEMA IF NOT EXISTS dannys_diner;
SET search_path = dannys_diner;

DROP TABLE IF EXISTS sales;
CREATE TABLE sales (
  "customer_id" VARCHAR(1),
  "order_date" DATE,
  "product_id" INTEGER
);

INSERT INTO sales
  ("customer_id", "order_date", "product_id")
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');
 
DROP TABLE IF EXISTS menu;
CREATE TABLE menu (
  "product_id" INTEGER,
  "product_name" VARCHAR(5),
  "price" INTEGER
);

INSERT INTO menu
  ("product_id", "product_name", "price")
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');
  
DROP TABLE IF EXISTS members;
CREATE TABLE IF NOT EXISTS members (
  "customer_id" VARCHAR(1),
  "join_date" DATE
);

INSERT INTO members
  ("customer_id", "join_date")
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

15 rows affected.

3 rows affected.

2 rows affected.

++
||
++
++

##### 1. What is the total amount each customer spent at the restaurant?

In [4]:
%%sql 
SELECT 
    s.customer_id,
    SUM(m.price) AS total_spent
FROM sales s
    LEFT JOIN menu m ON s.product_id = m.product_id
GROUP BY s.customer_id
ORDER BY customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-------------+-------------+
| customer_id | total_spent |
+-------------+-------------+
|      A      |      76     |
|      B      |      74     |
|      C      |      36     |
+-------------+-------------+

##### 2. How many days has each customer spent at the restaurant?

In [5]:
%%sql
SELECT 
    customer_id,
    COUNT(DISTINCT order_date) AS days_at_restaurant
FROM sales
GROUP BY customer_id
ORDER BY customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-------------+--------------------+
| customer_id | days_at_restaurant |
+-------------+--------------------+
|      A      |         4          |
|      B      |         6          |
|      C      |         2          |
+-------------+--------------------+

##### 3. What was the first item from the menu purchased by each customer?

In [6]:
%%sql
SELECT 
    DISTINCT s.customer_id,
    m.product_name
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id
WHERE (s.customer_id, s.order_date) IN 
    (SELECT 
        customer_id,
        MIN(order_date)
    FROM sales
    GROUP BY customer_id)
ORDER BY s.customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

4 rows affected.

+-------------+--------------+
| customer_id | product_name |
+-------------+--------------+
|      A      |    curry     |
|      A      |    sushi     |
|      B      |    curry     |
|      C      |    ramen     |
+-------------+--------------+

##### 4. What is the most purchased item on the menu and how many times was it purchased by all customers?

In [7]:
%%sql
SELECT 
    m.product_name,
    COUNT(s.product_id) AS purchase_count
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id 
GROUP BY m.product_name
ORDER BY purchase_count DESC
LIMIT 1

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

1 rows affected.

+--------------+----------------+
| product_name | purchase_count |
+--------------+----------------+
|    ramen     |       8        |
+--------------+----------------+

##### 5. Which item was the most popular for each customer?

In [8]:
%%sql
SELECT 
    s.customer_id,
    m.product_name
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id
GROUP BY s.customer_id, m.product_name
HAVING (s.customer_id, COUNT(m.product_id)) IN
    (SELECT 
        customer_id, 
        MAX(purchase_count)
     FROM 
         (SELECT 
              customer_id, 
              product_id, 
              COUNT(customer_id) AS purchase_count
          FROM sales
          GROUP BY customer_id, product_id) AS t1
     GROUP BY customer_id)
ORDER BY s.customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

5 rows affected.

+-------------+--------------+
| customer_id | product_name |
+-------------+--------------+
|      A      |    ramen     |
|      B      |    sushi     |
|      B      |    curry     |
|      B      |    ramen     |
|      C      |    ramen     |
+-------------+--------------+

Alternative solution using window function and common table expression:

In [9]:
%%sql
WITH purchase_count_rank_cte AS (
    SELECT 
        s.customer_id,
        m.product_name,
        COUNT(s.product_id) AS purchase_count,
        RANK() OVER (
            PARTITION BY s.customer_id
            ORDER BY COUNT(s.product_id) DESC) AS ranking
    FROM sales s 
        JOIN menu m ON s.product_id = m.product_id
    GROUP BY s.customer_id, m.product_name
)

SELECT 
    customer_id,
    product_name
FROM purchase_count_rank_cte
WHERE ranking = 1

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

5 rows affected.

+-------------+--------------+
| customer_id | product_name |
+-------------+--------------+
|      A      |    ramen     |
|      B      |    sushi     |
|      B      |    curry     |
|      B      |    ramen     |
|      C      |    ramen     |
+-------------+--------------+

##### 6. Which item was purchased first by the customer after they became a member?

In [10]:
%%sql
SELECT
    s.customer_id,
    m.product_name,
    s.order_date
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id
WHERE (s.customer_id, s.order_date) IN 
    (SELECT 
         m1.customer_id, 
         MIN(s1.order_date)
     FROM members m1 
         JOIN sales s1 ON m1.customer_id = s1.customer_id
     WHERE s1.order_date >= m1.join_date
     GROUP BY m1.customer_id)
ORDER BY customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

2 rows affected.

+-------------+--------------+------------+
| customer_id | product_name | order_date |
+-------------+--------------+------------+
|      A      |    curry     | 2021-01-07 |
|      B      |    sushi     | 2021-01-11 |
+-------------+--------------+------------+

##### 7. Which item was purchased just before the customer became a member?

In [11]:
%%sql
SELECT
    s.customer_id,
    m.product_name,
    s.order_date
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id
WHERE (s.customer_id, s.order_date) IN 
    (SELECT 
         m1.customer_id, 
         MAX(s1.order_date)
     FROM members m1 
         JOIN sales s1 ON m1.customer_id = s1.customer_id
     WHERE s1.order_date < m1.join_date
     GROUP BY m1.customer_id)
ORDER BY customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-------------+--------------+------------+
| customer_id | product_name | order_date |
+-------------+--------------+------------+
|      A      |    sushi     | 2021-01-01 |
|      A      |    curry     | 2021-01-01 |
|      B      |    sushi     | 2021-01-04 |
+-------------+--------------+------------+

##### 8. What is the total items and amount spent for each member before they became a member?

In [12]:
%%sql
SELECT 
    mb.customer_id,
    COUNT(s.product_id) AS total_items,
    SUM(me.price) AS total_spent
FROM members mb 
    JOIN sales s ON mb.customer_id = s.customer_id
    JOIN menu me ON s.product_id = me.product_id
WHERE s.order_date < mb.join_date
GROUP BY mb.customer_id
ORDER BY mb.customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

2 rows affected.

+-------------+-------------+-------------+
| customer_id | total_items | total_spent |
+-------------+-------------+-------------+
|      A      |      2      |      25     |
|      B      |      3      |      40     |
+-------------+-------------+-------------+

##### 9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [13]:
%%sql
SELECT 
    s.customer_id,
    SUM (
        CASE 
            WHEN m.product_name = 'sushi' THEN 20 * m.price
            ELSE 10 * m.price
        END
    ) AS total_points
FROM sales s 
    JOIN menu m ON s.product_id = m.product_id
GROUP BY s.customer_id
ORDER BY s.customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

3 rows affected.

+-------------+--------------+
| customer_id | total_points |
+-------------+--------------+
|      A      |     860      |
|      B      |     940      |
|      C      |     360      |
+-------------+--------------+

##### 10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [18]:
%%sql
SELECT 
    mb.customer_id,
    SUM (
        CASE 
            WHEN me.product_name = 'sushi' 
                OR s.order_date BETWEEN mb.join_date AND mb.join_date + INTERVAL '6 days'
                THEN 20 * me.price
            ELSE 10 * me.price
        END
    ) AS total_points
FROM members mb
    JOIN sales s ON mb.customer_id = s.customer_id
    JOIN menu me ON s.product_id = me.product_id
WHERE EXTRACT(month FROM s.order_date) = 1
GROUP BY mb.customer_id
ORDER BY mb.customer_id

Running query in 'postgresql://postgres:***@localhost:5433/SQLchallenge'

2 rows affected.

+-------------+--------------+
| customer_id | total_points |
+-------------+--------------+
|      A      |     1370     |
|      B      |     820      |
+-------------+--------------+